Wiznet/esp_wiz_toe/examples/tcp_client_over_ssl/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# 1 ms tick: the TOE poll loops (wiztoe_recv) yield in 1 ms steps and count
# those steps for SO_RCVTIMEO/SO_SNDTIMEO, which is how the mbedTLS BIO read
# timeout is implemented. At the IDF default of 100 Hz a 1 ms delay truncates to
# 0 ticks, which busy-waits and starves the idle task.
CONFIG_FREERTOS_HZ=1000
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# CONFIG_COMPILER_OPTIMIZATION_DEBUG is not set
# Keep default warnings as warnings. ESP-IDF flipped this Kconfig default in 6.0
# (y in 5.5 -> n in 6.0). With it off the build uses -Werror instead of
# -Werror=all, so warnings outside -Wall become errors too -- including the
# preprocessor "redefined" warning the vendored ioLibrary trips. sdkconfig is
# gitignored, so without pinning it here the result depends on which IDF version
# happened to generate it first.
CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=y
# --- wsm_driver shared settings (copied from loopback) ---
CONFIG_WSM_DRIVER_ENABLED=y
# Board = ESP32-W5500-Dev-kit, the component Kconfig default. The board fixes
# both the chip and the SPI pins; pick another one in menuconfig:
#   Component config -> WIZnet WSM Driver -> Board
CONFIG_WSM_DRIVER_BACKEND_TOE=y
# pins/clock come from the board selected above
# Route BSD sockets to the WIZnet TOE hardware sockets (builds wiznet_toe.c /
# wiztoe_wrap.c and adds the lwIP --wrap glue).
CONFIG_WSM_DRIVER_SOCKET_WRAP=y
